<a href="https://colab.research.google.com/github/ahvblackwelltech/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Ahvi_Blackwell_LS_DSPT4_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-11-07 00:05:20--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.243.6
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.243.6|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  46.4MB/s    in 4.6s

2019-11-07 00:05:24 (42.3 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
# Import Library
import pandas as pd

In [26]:
aisles = pd.read_csv('aisles.csv')
aisles.head()
# column aisle_id needed

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [27]:
aisles.shape

(134, 2)

In [75]:
display(example)

NameError: ignored

In [76]:
aisles.describe()

         aisle_id
count  134.000000
mean    67.500000
std     38.826537
min      1.000000
25%     34.250000
50%     67.500000
75%    100.750000
max    134.000000

In [28]:
departments = pd.read_csv('departments.csv')
departments.head()
# column department_id needed

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [29]:
departments.shape

(21, 2)

In [77]:
departments.describe()

       department_id
count      21.000000
mean       11.000000
std         6.204837
min         1.000000
25%         6.000000
50%        11.000000
75%        16.000000
max        21.000000

In [30]:
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__prior.head()
# column product_id & reordered needed

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [31]:
order_products__prior.shape

(32434489, 4)

In [78]:
order_products__prior.describe()

           order_id    product_id  add_to_cart_order     reordered
count  3.243449e+07  3.243449e+07       3.243449e+07  3.243449e+07
mean   1.710749e+06  2.557634e+04       8.351076e+00  5.896975e-01
std    9.873007e+05  1.409669e+04       7.126671e+00  4.918886e-01
min    2.000000e+00  1.000000e+00       1.000000e+00  0.000000e+00
25%    8.559430e+05  1.353000e+04       3.000000e+00  0.000000e+00
50%    1.711048e+06  2.525600e+04       6.000000e+00  1.000000e+00
75%    2.565514e+06  3.793500e+04       1.100000e+01  1.000000e+00
max    3.421083e+06  4.968800e+04       1.450000e+02  1.000000e+00

In [32]:
order_products__train = pd.read_csv('order_products__train.csv')
order_products__train.head()
# column product_id & reordered also needed

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [33]:
order_products__train.shape

(1384617, 4)

In [79]:
order_products__train.describe()

           order_id    product_id  add_to_cart_order     reordered
count  1.384617e+06  1.384617e+06       1.384617e+06  1.384617e+06
mean   1.706298e+06  2.555624e+04       8.758044e+00  5.985944e-01
std    9.897326e+05  1.412127e+04       7.423936e+00  4.901829e-01
min    1.000000e+00  1.000000e+00       1.000000e+00  0.000000e+00
25%    8.433700e+05  1.338000e+04       3.000000e+00  0.000000e+00
50%    1.701880e+06  2.529800e+04       7.000000e+00  1.000000e+00
75%    2.568023e+06  3.794000e+04       1.200000e+01  1.000000e+00
max    3.421070e+06  4.968800e+04       8.000000e+01  1.000000e+00

In [34]:
products = pd.read_csv('products.csv')
products.head()
# column product_id, product_name

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [35]:
products.shape

(49688, 4)

In [80]:
products.describe()

         product_id      aisle_id  department_id
count  49688.000000  49688.000000   49688.000000
mean   24844.500000     67.769582      11.728687
std    14343.834425     38.316162       5.850410
min        1.000000      1.000000       1.000000
25%    12422.750000     35.000000       7.000000
50%    24844.500000     69.000000      13.000000
75%    37266.250000    100.000000      17.000000
max    49688.000000    134.000000      21.000000

In [36]:
orders = pd.read_csv('orders.csv')
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [37]:
orders.shape

(3421083, 7)

In [81]:
orders.describe()

           order_id       user_id  ...  order_hour_of_day  days_since_prior_order
count  3.421083e+06  3.421083e+06  ...       3.421083e+06            3.214874e+06
mean   1.710542e+06  1.029782e+05  ...       1.345202e+01            1.111484e+01
std    9.875817e+05  5.953372e+04  ...       4.226088e+00            9.206737e+00
min    1.000000e+00  1.000000e+00  ...       0.000000e+00            0.000000e+00
25%    8.552715e+05  5.139400e+04  ...       1.000000e+01            4.000000e+00
50%    1.710542e+06  1.026890e+05  ...       1.300000e+01            7.000000e+00
75%    2.565812e+06  1.543850e+05  ...       1.600000e+01            1.500000e+01
max    3.421083e+06  2.062090e+05  ...       2.300000e+01            3.000000e+01

[8 rows x 6 columns]

In [38]:
# Merging the first set of needed datasets
df = pd.merge(order_products__prior, order_products__train, how='outer')
df.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [39]:
# Merging the second set of needed datasets
final_df = pd.merge(df, products[['product_id', 'product_name']])
final_df.head()

   order_id  product_id  add_to_cart_order  reordered        product_name
0         2       33120                  1          1  Organic Egg Whites
1        26       33120                  5          0  Organic Egg Whites
2       120       33120                 13          0  Organic Egg Whites
3       327       33120                  5          1  Organic Egg Whites
4       390       33120                 28          1  Organic Egg Whites

In [40]:
final_df.drop(['order_id', 'add_to_cart_order'], axis=1)

          product_id  ...                                       product_name
0              33120  ...                                 Organic Egg Whites
1              33120  ...                                 Organic Egg Whites
2              33120  ...                                 Organic Egg Whites
3              33120  ...                                 Organic Egg Whites
4              33120  ...                                 Organic Egg Whites
...              ...  ...                                                ...
33819101       27499  ...                  Non-Dairy Coconut Seven Layer Bar
33819102       27499  ...                  Non-Dairy Coconut Seven Layer Bar
33819103       37703  ...  Ultra Sun Blossom Liquid 90 loads Fabric Enhan...
33819104       43725  ...                               Sweetart Jelly Beans
33819105       36233  ...                            Water With Electrolytes

[33819106 rows x 3 columns]

In [42]:
cols = ['product_id', 'product_name', 'reordered']
final_df = final_df[cols]
final_df

          product_id  ... reordered
0              33120  ...         1
1              33120  ...         0
2              33120  ...         0
3              33120  ...         1
4              33120  ...         1
...              ...  ...       ...
33819101       27499  ...         0
33819102       27499  ...         0
33819103       37703  ...         0
33819104       43725  ...         0
33819105       36233  ...         0

[33819106 rows x 3 columns]

In [43]:
final_df.count()

product_id      33819106
product_name    33819106
reordered       33819106
dtype: int64

In [44]:
final_df.groupby(['product_name']).sum().sort_values('reordered', ascending=False)

                                                     product_id  reordered
product_name
Banana                                              12209563932     415166
Bag of Organic Bananas                               5203597680     329275
Organic Strawberries                                 5824871049     214448
Organic Baby Spinach                                 5513094615     194939
Organic Hass Avocado                                10427382293     176173
...                                                         ...        ...
Au Jus Base                                              102645          0
Au Jus Gravy                                              63380          0
Turkey Bacon Bits                                        269739          0
Day and Night Multi-Symptom and Severe Cold & C...        14079          0
Loose Powder                                              75500          0

[49685 rows x 2 columns]

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
%matplotlib inline
import pandas as pd 
import numpy as np
import seaborn as sns

In [0]:
table_1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11],
     [3,      1]],
     index=['Chris Brown', 'Lisa Bonet', 'Kendrick Lamar'],
     columns=['t_a', 't_b'])

table_2 = table_1.T

In [50]:
table_1

                 t_a  t_b
Chris Brown      NaN    2
Lisa Bonet      16.0   11
Kendrick Lamar   3.0    1

In [51]:
table_2

     Chris Brown  Lisa Bonet  Kendrick Lamar
t_a          NaN        16.0             3.0
t_b          2.0        11.0             1.0

In [52]:
table_1.index

Index(['Chris Brown', 'Lisa Bonet', 'Kendrick Lamar'], dtype='object')

In [0]:
#######   Table 1 ---> Tidy    ########

In [0]:
table_1 = table_1.reset_index()

In [54]:
table_1

            index   t_a  t_b
0     Chris Brown   NaN    2
1      Lisa Bonet  16.0   11
2  Kendrick Lamar   3.0    1

In [55]:
tidy = table_1.melt(id_vars='index')
tidy

            index variable  value
0     Chris Brown      t_a    NaN
1      Lisa Bonet      t_a   16.0
2  Kendrick Lamar      t_a    3.0
3     Chris Brown      t_b    2.0
4      Lisa Bonet      t_b   11.0
5  Kendrick Lamar      t_b    1.0

In [56]:
tidy.columns = ['name', 'trt', 'result']
tidy

             name  trt  result
0     Chris Brown  t_a     NaN
1      Lisa Bonet  t_a    16.0
2  Kendrick Lamar  t_a     3.0
3     Chris Brown  t_b     2.0
4      Lisa Bonet  t_b    11.0
5  Kendrick Lamar  t_b     1.0

In [0]:
#######   Table 2 ----> Tidy    ########

In [57]:
table_2

     Chris Brown  Lisa Bonet  Kendrick Lamar
t_a          NaN        16.0             3.0
t_b          2.0        11.0             1.0

In [60]:
table_2.index

Index(['t_a', 't_b'], dtype='object')

In [0]:
table_2 = table_2.reset_index()

In [62]:
table_2

  index  Chris Brown  Lisa Bonet  Kendrick Lamar
0   t_a          NaN        16.0             3.0
1   t_b          2.0        11.0             1.0

In [63]:
tidy_2 = table_2.melt(id_vars='index')
tidy_2

  index        variable  value
0   t_a     Chris Brown    NaN
1   t_b     Chris Brown    2.0
2   t_a      Lisa Bonet   16.0
3   t_b      Lisa Bonet   11.0
4   t_a  Kendrick Lamar    3.0
5   t_b  Kendrick Lamar    1.0

In [64]:
tidy_2.columns = ['trt', 'name', 'result']
tidy_2

   trt            name  result
0  t_a     Chris Brown     NaN
1  t_b     Chris Brown     2.0
2  t_a      Lisa Bonet    16.0
3  t_b      Lisa Bonet    11.0
4  t_a  Kendrick Lamar     3.0
5  t_b  Kendrick Lamar     1.0

In [0]:
#######   Tidy ----> Table 1   ########

In [65]:
table_1

            index   t_a  t_b
0     Chris Brown   NaN    2
1      Lisa Bonet  16.0   11
2  Kendrick Lamar   3.0    1

In [66]:
tidy.pivot_table(index='name', columns='trt', values='result')

trt              t_a   t_b
name
Chris Brown      NaN   2.0
Kendrick Lamar   3.0   1.0
Lisa Bonet      16.0  11.0

In [0]:
#######   Tidy ----> Table 2   ########

In [69]:
table_2

  index  Chris Brown  Lisa Bonet  Kendrick Lamar
0   t_a          NaN        16.0             3.0
1   t_b          2.0        11.0             1.0

In [70]:
tidy_2.pivot_table(index='trt', columns='name', values='result')

name  Chris Brown  Kendrick Lamar  Lisa Bonet
trt
t_a           NaN             3.0        16.0
t_b           2.0             1.0        11.0

In [0]:
#######   Loading Seaborn's Flights Datasets    ########

In [0]:
flights = sns.load_dataset('flights')

In [73]:
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [74]:
flights.pivot_table(index='year', columns='month')

      passengers                       ...
month    January February March April  ... September October November December
year                                   ...
1949         112      118   132   129  ...       136     119      104      118
1950         115      126   141   135  ...       158     133      114      140
1951         145      150   178   163  ...       184     162      146      166
1952         171      180   193   181  ...       209     191      172      194
1953         196      196   236   235  ...       237     211      180      201
1954         204      188   235   227  ...       259     229      203      229
1955         242      233   267   269  ...       312     274      237      278
1956         284      277   317   313  ...       355     306      271      306
1957         315      301   356   348  ...       404     347      305      336
1958         340      318   362   348  ...       404     359      310      337
1959         360      342   406   396  ...       463     407      362      405
1960         417      391   419   461  ...       508     461      390      432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####